{
    "help": {
        "_": "This module is aimed at assisting you with using S4.",
        "help": {
            "description": "Help with anything S4. Passing a command name or alias through will show help with that specific command, while passing no arguments will bring up a general command overview."
        }
    },
    "meta": {
        "_": "Commands for retrieving information regarding S4, from invitation links to detailed bot statistics.",
        "about": {
            "description": "View information regarding those behind S4's development. This includes the developer and the testers, and also shows copyright information."
        },
        "support": {
            "description": "Provides an invite link to S4's support server."
        },
        "invite": {
            "description": "Provides the links necessary to invite S4 to other servers."
        },
        "ping": {
            "description": "Pings S4."
        },
        "prefix": {
            "description": "Displays S4's prefix in your server. Note that mentioning S4 will always work."
        },
        "botinfo": {
            "description": "Displays statistical information on S4. This includes process and composition information, and also includes information about S4's reach."
        },
        "userinfo": {
            "description": "Displays information on a given user. If no user is provided, S4 will display your information. Note that although S4 can display information about any user on Discord, the amount of information available is significantly lower for users not in the server the command was invoked in."
        },
        "avatar": {
            "description": "Displays the avatar (or profile picture) of a given user. This is not limited to server members."
        },
        "serverinfo": {
            "description": "Displays information on your server."
        },
        "detailedserverinfo": {
            "description": "Displays more detailed information on your server. This command does not display well on mobile."
        },
        "icon": {
            "description": "Displays the icon of your server."
        }
    },
    "mod": {
        "_": "Basic moderation actions designed to help you keep your server clean and safe.",
        "kick": {
            "description": "Kicks one or more members from your server.",
            "user requirements": ["Kick Members"],
            "bot requirements": ["Kick Members"]
        },
        "ban": {
            "description": "Bans one or more members from your server.",
            "user requirements": ["Ban Members"],
            "bot requirements": ["Ban Members"]
        },
        "clear": {
            "description": "Clears up to 100 messages from a channel.",
            "user requirements": ["Manage Messages"],
            "bot requirements": ["Manage Messages"]
        },
        "clearchannel": {
            "description": "Clears an entire channel of messages.",
            "user requirements": ["Manage Messages", "Manage Channels"],
            "bot requirements": ["Manage Channels"]
        },
        "mute": {
            "description": "Mutes one or more members of your server.",
            "user requirements": ["Manage Roles"],
            "bot requirements": ["Manage Roles"]
        }
    }
}
